app/controllers/comments_controller.rb

  def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "commenter") VALUES (?, ?, ?, ?, ?)  [["body", "ゆき"], ["post_id", 6], ["created_at", "2017-10-01 02:38:23.076985"], ["updated_at", "2017-10-01 02:38:23.076985"], ["commenter", "yuki"]]