app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$bxwlcto.Hdi0R20qE1nfWODvGvxI44dCg2oa.EMFlcXg3yKsQ/elm"], ["updated_at", "2017-10-17 07:24:48.712793"], ["id", 101]]
---
  def update
    if params[:user][:password].empty?                  # (3) への対応
      @user.errors.add(:password, :blank)
      render 'edit'
    elsif @user.update_attributes(user_params)          # (4) への対応