app/controllers/posts_controller.rb

  def index
    @posts = current_user.posts.order(created_at: 'desc')
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

	def create
	  @post = current_user.posts.build(post_params)
    Rails.logger.info @post.inspect
		if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2017-09-28 06:50:47.032831"], ["updated_at", "2017-09-28 06:50:47.032831"]]